In [5]:
#GO_STP_6970
#kishan singh

**1. OneHotEncoding**

OneHotEncoding is a prpcess to convert string data into numeric data, but data should be categorical value.

The input to the transformer should be an array like of integers or string, denoting the value takenby categorical feature. This creates a binary columns and returns the spars matrix or dense array.

**2. Multicollinearity**

It is a phenomenon in which one predictor variable in a multiple regression model can be linearly predicted from the others with accuracy.

It neither reduce the predictive power nor reliablility of the model as whole, at least within the sample data set; it only affects calculations regarding individual predictors

**3. Dummy Variable** 

It is a scenario where there are attributes which are highly correlated and one varable predicts the value of others. When we use one hot encoding for handling the categorical data, then one attribute can be predicted with the help of other dummy variables. 

For example, Sex having two values male and female. Either they can be 1/0 or 0/1. Including both dummy variable can cause redundancy because if a person is not male in such case the person is female, hence,  we don't need to  use both the variables in model.

**4. Nominal Variable**

It describes a variable with categories that do not have order or sequence.

Example: blood type, sex

**5. Ordinal Variable**

It describes the variable with order or sequence.

Example: Sentiment("poor", "bad", "neutral", "good", "very good")

In [4]:
import pandas as pd

url = "https://data.princeton.edu/wws509/datasets/salary.dat"
df = pd.read_csv(url, delim_whitespace = True)
df.head()

       sx    rk  yr         dg  yd     sl
0    male  full  25  doctorate  35  36350
1    male  full  13  doctorate  22  35350
2    male  full  10  doctorate  23  28200
3  female  full   7  doctorate  27  26775
4    male  full  19    masters  30  33696

In [7]:
df.tail()

        sx         rk  yr         dg  yd     sl
47  female  assistant   2  doctorate   2  15350
48    male  assistant   1  doctorate   1  16244
49  female  assistant   1  doctorate   1  16686
50  female  assistant   1  doctorate   1  15000
51  female  assistant   0  doctorate   2  20300

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sx      52 non-null     object
 1   rk      52 non-null     object
 2   yr      52 non-null     int64
 3   dg      52 non-null     object
 4   yd      52 non-null     int64
 5   sl      52 non-null     int64
dtypes: int64(3), object(3)
memory usage: 2.6+ KB

In [9]:
df.describe()

              yr         yd            sl
count  52.000000  52.000000     52.000000
mean    7.480769  16.115385  23797.653846
std     5.507536  10.222340   5917.289154
min     0.000000   1.000000  15000.000000
25%     3.000000   6.750000  18246.750000
50%     7.000000  15.500000  23719.000000
75%    11.000000  23.250000  27258.500000
max    25.000000  35.000000  38045.000000

In [13]:
df.isnull().any()

sx    False
rk    False
yr    False
dg    False
yd    False
sl    False
dtype: bool

In [12]:
df.shape

(52, 6)

In [14]:
df.columns

Index(['sx', 'rk', 'yr', 'dg', 'yd', 'sl'], dtype='object')

In [22]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df.sx = le.fit_transform(df.sx)
df.head(10)

   sx  rk  yr  dg  yd     sl
0   1   2  25   0  35  36350
1   1   2  13   0  22  35350
2   1   2  10   0  23  28200
3   0   2   7   0  27  26775
4   1   2  19   1  30  33696
5   1   2  16   0  21  28516
6   0   2   0   1  32  24900
7   1   2  16   0  18  31909
8   1   2  13   1  30  31850
9   1   2  13   1  31  32850

In [21]:
df.rk=le.fit_transform(df.rk)
df.head(10)

   sx  rk  yr  dg  yd     sl
0   1   2  25   0  35  36350
1   1   2  13   0  22  35350
2   1   2  10   0  23  28200
3   0   2   7   0  27  26775
4   1   2  19   1  30  33696
5   1   2  16   0  21  28516
6   0   2   0   1  32  24900
7   1   2  16   0  18  31909
8   1   2  13   1  30  31850
9   1   2  13   1  31  32850

In [20]:
df.dg=le.fit_transform(df.dg)
df.head(10)

   sx  rk  yr  dg  yd     sl
0   1   2  25   0  35  36350
1   1   2  13   0  22  35350
2   1   2  10   0  23  28200
3   0   2   7   0  27  26775
4   1   2  19   1  30  33696
5   1   2  16   0  21  28516
6   0   2   0   1  32  24900
7   1   2  16   0  18  31909
8   1   2  13   1  30  31850
9   1   2  13   1  31  32850